/**
 * Created by wfsovereign on 15-1-6.
 */

function printInventoryB(inputs){
    var result =
        '***<没钱赚商店>购物清单***\n' +
        '名称：可口可乐350ml，数量：20瓶，单价：3.00(元)，小计：60.00(元)\n' +
        '名称：可口可乐550ml，数量：20瓶，单价：4.00(元)，小计：80.00(元)\n' +
        '名称：康师傅方便面，数量：30袋，单价：4.50(元)，小计：135.00(元)\n' +
        '名称：康师傅冰红茶，数量：25瓶，单价：3.00(元)，小计：75.00(元)\n' +
        '名称：云山荔枝，数量：12斤，单价：15.00(元)，小计：180.00(元)\n' +
        '名称：云山苹果，数量：14斤，单价：5.50(元)，小计：77.00(元)\n' +
        '----------------------\n' +
        '优惠信息：\n' +
        '名称：可口可乐350ml单品打折，金额：3.00元\n' +
        '名称：可口可乐品牌打折，金额：14.00元\n' +
        '名称：康师傅品牌满100减2，金额：4.00元\n' +
        '名称：云山荔枝满100减5，金额：5.00元\n' +
        '----------------------\n' +
        '总计：547.00(元)\n' +
        '节省：20.00(元)\n' +
        '**********************';
    console.log(result);
}